sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
	// Check signal AT+CSQ
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Check_Signal], sizeof(uart_Tx[ATCMD_Check_Signal])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
	  {
		//Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);

	print_atCommand(recv2, uart2_msg_print_switch);
	memset(recv2, 0, UART2_RX_LENGTH);


	// GPS
	// Configures the data flow to and from a u-blox GPS receiver connected to the Wireless Module AT+UGPRF=1
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Config_GPS], sizeof(uart_Tx[ATCMD_Config_GPS])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
	  {
		//Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);


	print_atCommand(recv2, uart2_msg_print_switch);
	memset(recv2, 0, UART2_RX_LENGTH);



	// Enable the NMEA $RMC messages AT+UGRMC=1
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Enable_RMC], sizeof(uart_Tx[ATCMD_Enable_RMC])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
	  {
		//Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);

	print_atCommand(recv2, uart2_msg_print_switch);
	memset(recv2, 0, UART2_RX_LENGTH);


	// Enable GPS AT+UGPS=1
	HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Enable_GPS], sizeof(uart_Tx[ATCMD_Enable_GPS])-1, 30);
	HAL_UART_Transmit(&huart2, "\r", 1, 30);

	if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
	  {
		//Error_Handler();
	  }
	osDelay(UART2_ATCMD_DELAY);
	HAL_UART_Abort_IT(&huart2);

	print_atCommand(recv2, uart2_msg_print_switch);
	memset(recv2, 0, UART2_RX_LENGTH);

	//uint8_t recv2 = 0;
	//HAL_StatusTypeDef u2_states = HAL_OK;
    /* Infinite loop */
    for(;;)
    {
		/*if(HAL_UART_Receive_DMA(&huart2, (uint8_t*)&recv2, 1) == HAL_OK){
			HAL_UART_Transmit_DMA(&huart2, (uint8_t*)&recv2, 1);
		}*/


    	/*##-2- Start the transmission process #####################################*/
    	  /* While the UART in reception process, user can transmit data through
    	     "aTxBuffer" buffer */
    	#if 0
    	if(HAL_UART_Transmit(&huart2, "+CSQ: 2,5", 10, 5000)!= HAL_OK)
    	  {
    	    Error_Handler();
    	  }


    	  /*##-3- Put UART peripheral in reception process ###########################*/
    	  if(HAL_UART_Receive(&huart2, (uint8_t *)recv2, 10, 5000) != HAL_OK)
    	  {
    	    Error_Handler();
    	  }



    	  if(HAL_UART_Receive_IT(&huart2, (uint8_t*)&recv2, 10)!= HAL_OK)
    	{
    		Error_Handler();
    	}

    	while (UartReady != SET)
		  {
		  }
#endif



    	// Get the NMEA $RMC messages
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Get_GPS_DATA], sizeof(uart_Tx[ATCMD_Get_GPS_DATA])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		  {
			//Error_Handler();
		  }
		else
		{
			print_atCommand(recv2, uart2_msg_print_switch);


			if(uart2_isFindString(recv2, string_Not, 3) == 1)
			{
				// Enable GPS AT+UGPS=1
				HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Enable_GPS], sizeof(uart_Tx[ATCMD_Enable_GPS])-1, 30);
				HAL_UART_Transmit(&huart2, "\r", 1, 30);

				if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
				  {
					//Error_Handler();
				  }
				osDelay(UART2_ATCMD_DELAY);
				HAL_UART_Abort_IT(&huart2);

				print_atCommand(recv2, uart2_msg_print_switch);
				memset(recv2, 0, UART2_RX_LENGTH);

				osDelay(UART2_ATCMD_DELAY*2);
			}
			else
			{
				// find data index
				latitude_index = reg_index = uart2_findCommaIndexNext(recv2,4);
				longitude_index = reg_index = uart2_findCommaIndexNext(recv2,6);

				// Get latitude and longitude data
				latitude = 0;   //24
				longitude = 0;  //121
				if(recv2[latitude_index] != ',')
				{
					// latitude
					for( i = 0; i < 10; i++)
					{
						if(i < 4)
						{
							latitude = 10*latitude + recv2[latitude_index+i];
						}
						else if(i > 4)
						{
							latitude = 10*latitude + recv2[latitude_index+i-1];
						}
					}

					// longitude
					for( i = 0; i < 11; i++)
					{
						if(i < 5)
						{
							longitude = 10*longitude + recv2[longitude_index+i];
						}
						else if(i > 5)
						{
							longitude = 10*longitude + recv2[longitude_index+i-1];
						}
					}
				}

				// send data to queue
				if( osMessagePut(UART2_LAT_QHandle, latitude, UART2_TIMEOUT) != osOK )
				{
					aewin_dbg("\n\rUART2 GPS latitude put Q failed. \r\n");
				}

				if( osMessagePut(UART2_LONG_QHandle, longitude, UART2_TIMEOUT) != osOK )
				{
					aewin_dbg("\n\rUART2 GPS longitude put Q failed. \r\n");
				}
			}
		}
		osDelay(UART2_ATCMD_DELAY);
		HAL_UART_Abort_IT(&huart2);
		memset(recv2, 0, UART2_RX_LENGTH);


		// Airplane mode or normal mode AT+CFUN?
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Get_airplane], sizeof(uart_Tx[ATCMD_Get_airplane])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		  {
			//Error_Handler();
		  }
		osDelay(UART2_ATCMD_DELAY);
		HAL_UART_Abort_IT(&huart2);

		if(recv2[35] == '4')
		{
			r280_module_state.normal_flight_states = 40;
		}
		else //0,1,19
		{
			r280_module_state.normal_flight_states = 10;
		}

		print_atCommand(recv2, uart2_msg_print_switch);
		aewin_dbg("SIM mode is %d (airplane mode is '4')\r\n",  (recv2[35]-'0'));
		memset(recv2, 0, UART2_RX_LENGTH);


		// Get 3G,4G status AT+COPS?
		HAL_UART_Transmit(&huart2, uart_Tx[ATCMD_Check_Reg], sizeof(uart_Tx[ATCMD_Check_Reg])-1, 30);
		HAL_UART_Transmit(&huart2, "\r", 1, 30);

		if(HAL_UART_Receive_DMA(&huart2, recv2, UART2_RX_LENGTH) != HAL_OK)
		  {
			//Error_Handler();
		  }
		osDelay(UART2_ATCMD_DELAY*3);
		HAL_UART_Abort_IT(&huart2);

		reg_index = uart2_findCommaIndexNext(recv2,3);

		if(recv2[reg_index] == '7')                  //4G
		{
			r280_module_state.register_3G_4G = 7;
		}
		else if(recv2[reg_index] == '2')             //3G
		{
			r280_module_state.register_3G_4G = 2;
		}
		else if(recv2[reg_index] == '0')             //2G
		{
			r280_module_state.register_3G_4G = 0;
		}

		print_atCommand(recv2, uart2_msg_print_switch);
		memset(recv2, 0, UART2_RX_LENGTH);


