sunnike/SVA-1000/STM32F091RCTx_freeRTOS/Src/freertos.c
		/** Get the ADC value of MCU temperature. */
		evt = osMessageGet(ADC_TEMP_QHandle, osWaitForever);
		if (evt.status == osEventMessage){
			adc_temp = evt.value.v;
			//aewin_dbg("\n\r");
			//aewin_dbg("\n\rGet ADC TEMP = %.1d.%.2d V", (((adc_temp & 0xfffU) * 330) / 409600), \
													  ((((adc_temp & 0xfffU) * 330) / 4096) % 100));
		}


		//switch(ig_event.IG_States){
		switch(current_IgEvent[NUM_ig_states]){
			case IG_Recovery:
				// Recovery all of IG states and parameters.
				ig_event = gIG_Event;
				for(index = 0; index<NUM_total;index++)
				{
					current_IgEvent[index] = flash_IgEvent[index];
				}
				//ig_event.IG_States = IG_CloseUp;
				current_IgEvent[NUM_ig_states] = IG_CloseUp;
				break;

			//-------------------------------------------------------------------------------------
			case IG_CloseUp:
				// Judge the IG switch states.
				if(sva_gpi.ig_sw == GPIO_PIN_SET){
					/* IG On process */
					// Ready to enter IG_PowerOn_Delay state.
					//ig_event.IG_States = IG_PowerOn_Delay;
					current_IgEvent[NUM_ig_states] = IG_PowerOn_Delay;


					// Reset the "Start up timeout"
					//ig_event.startup_timeout = gIG_Event.startup_timeout;
					current_IgEvent[NUM_startup_timeout] = flash_IgEvent[NUM_startup_timeout];
					aewin_dbg("\n\rIgnition ON! IG_CloseUp --> IG_PowerOn_Delay");
				}

				// Judge the power button states.
				if(sva_gpi.pwr_btn == GPIO_PIN_RESET){
					//ig_event.startup_timeout = gIG_Event.startup_timeout;
					current_IgEvent[NUM_startup_timeout] = flash_IgEvent[NUM_startup_timeout];
					//ig_event.IG_States = IG_Wait_StartUp;
					current_IgEvent[NUM_ig_states] = IG_Wait_StartUp;
					aewin_dbg("\n\rPower button On! IG_CloseUp --> IG_Wait_StartUp");
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_PowerOn_Delay:
				// Judge the IG switch states.
				if(sva_gpi.ig_sw == GPIO_PIN_SET){
					//if (0 == (ig_event.pwron_delay--)){
					if (0 == (current_IgEvent[NUM_pwron_delay]--)){
						//ig_event.pwron_delay = gIG_Event.pwron_delay;
						current_IgEvent[NUM_pwron_delay] = flash_IgEvent[NUM_pwron_delay];
						//ig_event.IG_States = IG_Wait_StartUp;
						current_IgEvent[NUM_ig_states] = IG_Wait_StartUp;
						aewin_dbg("\n\rPower on delay pass! IG_PowerOn_Delay --> IG_Wait_StartUp");
					}
				}
				else{
					//ig_event.pwron_delay = gIG_Event.pwron_delay;
					current_IgEvent[NUM_pwron_delay] = flash_IgEvent[NUM_pwron_delay];
					//ig_event.IG_States = IG_CloseUp;
					current_IgEvent[NUM_ig_states] = IG_CloseUp;
					aewin_dbg("\n\rPower on delay failed! IG_PowerOn_Delay --> IG_CloseUp");
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_Wait_StartUp:
				/* Power button has been (long) pressed. */
				if(sva_gpi.pwr_btn == GPIO_PIN_RESET){
					//ig_event.pwrbtn_pressed = TRUE;
					current_IgEvent[NUM_pwrbtn_pressed] = TRUE;
					//if(0 == (ig_event.pwroff_btn_cnt--)){
					if(0 == (current_IgEvent[NUM_pwroff_btn_cnt]--)){
						//ig_event.IG_States = IG_Recovery;
						current_IgEvent[NUM_ig_states] = IG_Recovery;
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
						enable_4GModule();
						aewin_dbg("\n\rIG_Wait_StartUp failed! IG_Wait_StartUp --> IG_Recovery");
					}
				}

				//if(ig_event.pwrbtn_pressed && (sva_gpi.pwr_btn == GPIO_PIN_SET)){
				if(current_IgEvent[NUM_pwrbtn_pressed] && (sva_gpi.pwr_btn == GPIO_PIN_SET)){
					//ig_event.pwroff_btn_cnt = gIG_Event.pwroff_btn_cnt;
					current_IgEvent[NUM_pwroff_btn_cnt] = flash_IgEvent[NUM_pwroff_btn_cnt];
					//ig_event.pwrbtn_pressed = FALSE;
					current_IgEvent[NUM_pwrbtn_pressed] = FALSE;
				}

				if(sva_gpi.ig_sw == GPIO_PIN_SET){
					//if (0 == (ig_event.wait_startup_time--)){
					if (0 == (current_IgEvent[NUM_wait_startup_time]--)){
						//ig_event.wait_startup_time = gIG_Event.wait_startup_time;
						current_IgEvent[NUM_wait_startup_time] = flash_IgEvent[NUM_wait_startup_time];
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_SET);
						enable_4GModule();
						// Confirm the the DC2DC power and system power are available.
						while((sva_gpi.dc2dc_pwrok != GPIO_PIN_SET) || (sva_gpi.sys_pwron == GPIO_PIN_SET)){
							//if(0 == (ig_event.pwrgood_chk_time--)){
							if(0 == (current_IgEvent[NUM_pwrgood_chk_time]--)){
								break;
							}
						}
						//if(0 != ig_event.pwrgood_chk_time){
						if(0 != current_IgEvent[NUM_pwrgood_chk_time]){
							//ig_event.IG_States = IG_Start_Up;
							current_IgEvent[NUM_ig_states] = IG_Start_Up;
							aewin_dbg("\n\rPower on delay ok! IG_Wait_StartUp --> IG_Start_Up");
						}
						else{
							HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
							enable_4GModule();
							//ig_event.IG_States = IG_CloseUp;
							current_IgEvent[NUM_ig_states] = IG_CloseUp;
							aewin_dbg("\n\rDE2DC Power on failed! IG_Wait_StartUp --> IG_CloseUp");
						}
						//ig_event.pwrgood_chk_time = gIG_Event.pwrgood_chk_time;
						current_IgEvent[NUM_pwrgood_chk_time] = flash_IgEvent[NUM_pwrgood_chk_time];
					}
				}
				else{
					//ig_event.wait_startup_time = gIG_Event.wait_startup_time;
					current_IgEvent[NUM_wait_startup_time] = flash_IgEvent[NUM_wait_startup_time];
					//ig_event.IG_States = IG_PowerOn_Delay;
					current_IgEvent[NUM_ig_states] = IG_PowerOn_Delay;
					aewin_dbg("\n\rIG_Wait_StartUp failed! IG_Wait_StartUp --> IG_PowerOn_Delay");
				}
				break;

			//-------------------------------------------------------------------------------------
			case IG_Start_Up:
				//if(ig_event.startup_timeout > 0){
				if(current_IgEvent[NUM_startup_timeout] > 0){
					/* Lock ignition off to prevent that user shutdowns the OS. */
					//ig_event.startup_timeout--;
					current_IgEvent[NUM_startup_timeout]--;
					aewin_dbg("\n\rLock power on!");
				}
				else{
					if( sva_gpi.ig_sw ==  GPIO_PIN_RESET){
						//ig_event.IG_States = IG_Shutdown_Delay;
						current_IgEvent[NUM_ig_states] = IG_Shutdown_Delay;
						aewin_dbg("\n\rIngition switch off! IG_Start_Up --> IG_Shutdown_Delay");
					}
				}

				if(sva_gpi.pwr_btn == GPIO_PIN_RESET){
					//ig_event.pwrbtn_pressed = TRUE;
					current_IgEvent[NUM_pwrbtn_pressed] = TRUE;
					//if(0 == (ig_event.pwroff_btn_cnt--)){
					if(0 == (current_IgEvent[NUM_pwroff_btn_cnt]--)){
						HAL_GPIO_WritePin(GPIOC, D2D_EN_Pin, GPIO_PIN_RESET);
						enable_4GModule();
						//ig_event.IG_States = IG_Recovery;
						current_IgEvent[NUM_ig_states] = IG_Recovery;
					}
				}

				//if(ig_event.pwrbtn_pressed && (sva_gpi.pwr_btn == GPIO_PIN_SET)){
				if(current_IgEvent[NUM_pwrbtn_pressed] && (sva_gpi.pwr_btn == GPIO_PIN_SET)){
					//ig_event.pwroff_btn_cnt = gIG_Event.pwroff_btn_cnt;
					current_IgEvent[NUM_pwroff_btn_cnt] = flash_IgEvent[NUM_pwroff_btn_cnt];
					//ig_event.pwrbtn_pressed = FALSE;
					current_IgEvent[NUM_pwrbtn_pressed] = FALSE;
					//ig_event.IG_States = IG_shutting_Down;
					current_IgEvent[NUM_ig_states] = IG_shutting_Down;
					aewin_dbg("\n\rPower button off! IG_Start_Up --> IG_shutting_Down");
				}

				break;

